#Область ПодключениеОбработкиКБСП

Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();

	ПараметрыРегистрации.Вставить("Вид",ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка());
	ПараметрыРегистрации.Вставить("Версия","1.1");
	//ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование","Плагин_RabbitMQ_экспорт_Документ_ОтчетОРозничныхПродажах");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация","Плагин_RabbitMQ_экспорт_Документ_ОтчетОРозничныхПродажах");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "3.1.5.180");
	//ПараметрыРегистрации.Вставить("ОпределитьНастройкиФормы", Ложь);
	
	
	ТипКоманды = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	ДобавитьКоманду(ПараметрыРегистрации.Команды, 
		"Открыть форму : Плагин_RabbitMQ_экспорт_Документ_ОтчетОРозничныхПродажах",
		"Форма_Плагин_RabbitMQ_экспорт_Документ_ОтчетОРозничныхПродажах",
		ТипКоманды, 
		Ложь) ;
	
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")

	//ТаблицаКоманд.Колонки.Добавить("Представление", РеквизитыТабличнойЧасти.Представление.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Идентификатор", РеквизитыТабличнойЧасти.Идентификатор.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	//ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", РеквизитыТабличнойЧасти.ПоказыватьОповещение.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Модификатор", РеквизитыТабличнойЧасти.Модификатор.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Скрыть",      РеквизитыТабличнойЧасти.Скрыть.Тип);
	//ТаблицаКоманд.Колонки.Добавить("ЗаменяемыеКоманды", РеквизитыТабличнойЧасти.ЗаменяемыеКоманды.Тип);
	
//           ** Использование - Строка - тип команды:
//               "ВызовКлиентскогоМетода",
//               "ВызовСерверногоМетода",
//               "ЗаполнениеФормы",
//               "ОткрытиеФормы" или
//               "СценарийВБезопасномРежиме".
//               Для получения типов команд рекомендуется использовать функции
//               ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКоманды<ИмяТипа>.
//               В комментариях к этим функциям также даны шаблоны процедур-обработчиков команд.

	НоваяКоманда = ТаблицаКоманд.Добавить() ;
	НоваяКоманда.Представление = Представление ;
	НоваяКоманда.Идентификатор = Идентификатор ;
	НоваяКоманда.Использование = Использование ;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение ;
	НоваяКоманда.Модификатор = Модификатор ;
КонецПроцедуры


#КонецОбласти 	

Функция ВыгрузитьОбъект(ДанныеСсылка) Экспорт
	Если ТипЗнч(ДанныеСсылка) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
		Обк = ДанныеСсылка.ПолучитьОбъект(); 
	Иначе 
		Обк = ДанныеСсылка; 
	КонецЕсли;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб);
	ЗаписьJson = Новый ЗаписьJSON;
	ЗаписьJson.УстановитьСтроку(ПараметрыЗаписиJSON);
	// Это основной объект json-сообщения
	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("source", "retail");
	СтруктураОбъекта.Вставить("type", Обк.метаданные().ПолноеИмя());
	СтруктураОбъекта.Вставить("datetime", XMLСтрока(ТекущаяДатаСеанса()));
	identification = ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Ссылка);
	СтруктураОбъекта.Вставить("identification", identification);
	//	DEFINITION          
	definition = ксп_ЭкспортСлужебный.СоздатьУзелDefinition(Обк.Ссылка);
	definition.Вставить("ЕстьМаркируемаяПродукцияГИСМ", Обк.ЕстьМаркируемаяПродукцияГИСМ);
	definition.Вставить("КассаККМ", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.КассаККМ));
	definition.Вставить("КассоваяСмена", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.КассоваяСмена));
	definition.Вставить("Комментарий", Обк.Комментарий);
	definition.Вставить("Магазин", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Магазин));
	definition.Вставить("ОплатаПодарочнымиСертификатами", Обк.ОплатаПодарочнымиСертификатами);
	definition.Вставить("Организация", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Организация));
	definition.Вставить("Ответственный", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Ответственный));
	definition.Вставить("СуммаВозвратов", Обк.СуммаВозвратов);
	definition.Вставить("СуммаДокумента", Обк.СуммаДокумента);
	definition.Вставить("СуммаОплатыНаличных", Обк.СуммаОплатыНаличных);
	definition.Вставить("УдалитьДоговорЭквайринга", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.УдалитьДоговорЭквайринга));
	definition.Вставить("УчитыватьНДС", Обк.УчитыватьНДС);
	definition.Вставить("ЦенаВключаетНДС", Обк.ЦенаВключаетНДС);
	definition.Вставить("Эквайрер", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Эквайрер));

	//------------------------------------------------------     ТЧ Товары

	ТЧТовары = Новый Массив;

	Для сч = 0 По обк.Товары.Количество()-1 Цикл

		стрк = обк.Товары[сч];

		НовСтр = Новый Структура;

		НовСтр.Вставить("АналитикаХозяйственнойОперации", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.АналитикаХозяйственнойОперации));
		НовСтр.Вставить("ДисконтнаяКарта", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ДисконтнаяКарта));
		НовСтр.Вставить("Договор", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Договор));
		НовСтр.Вставить("ЗаказПокупателя", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ЗаказПокупателя));
		НовСтр.Вставить("КлючСвязи", стрк.КлючСвязи);
		НовСтр.Вставить("КлючСвязиСерийныхНомеров", стрк.КлючСвязиСерийныхНомеров);
		НовСтр.Вставить("КлючСвязиУслугаАгента", стрк.КлючСвязиУслугаАгента);
		НовСтр.Вставить("КодСтроки", стрк.КодСтроки);
		НовСтр.Вставить("Количество", стрк.Количество);
		НовСтр.Вставить("КоличествоУпаковок", стрк.КоличествоУпаковок);
		НовСтр.Вставить("Номенклатура", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Номенклатура));
		НовСтр.Вставить("НомерГТД", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.НомерГТД));
		НовСтр.Вставить("Поставщик", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Поставщик));
		НовСтр.Вставить("Продавец", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Продавец));
		НовСтр.Вставить("ПроцентСкидкиНаценки", стрк.ПроцентСкидкиНаценки);
		НовСтр.Вставить("РегистрацияПродажи", стрк.РегистрацияПродажи);
		НовСтр.Вставить("Резервировать", стрк.Резервировать);
		НовСтр.Вставить("Склад", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Склад));
		НовСтр.Вставить("СтавкаНДС", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.СтавкаНДС));
		НовСтр.Вставить("СтатусУказанияСерий", стрк.СтатусУказанияСерий);
		НовСтр.Вставить("Сумма", стрк.Сумма);
		НовСтр.Вставить("СуммаНДС", стрк.СуммаНДС);
		НовСтр.Вставить("Упаковка", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Упаковка));
		НовСтр.Вставить("Характеристика", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Характеристика));
		НовСтр.Вставить("Цена", стрк.Цена);
		ТЧТовары.Добавить(НовСтр);

	КонецЦикла;

	definition.Вставить("ТЧТовары", ТЧТовары);

	//------------------------------------------------------     ТЧ ОплатаПлатежнымиКартами

	ТЧОплатаПлатежнымиКартами = Новый Массив;

	Для сч = 0 По обк.ОплатаПлатежнымиКартами.Количество()-1 Цикл

		стрк = обк.ОплатаПлатежнымиКартами[сч];

		НовСтр = Новый Структура;

		НовСтр.Вставить("ВидОплаты", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ВидОплаты));
		НовСтр.Вставить("ДоговорКонтрагента", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ДоговорКонтрагента));
		НовСтр.Вставить("ПроцентКомиссии", стрк.ПроцентКомиссии);
		НовСтр.Вставить("Сумма", стрк.Сумма);
		НовСтр.Вставить("СуммаКомиссии", стрк.СуммаКомиссии);
		НовСтр.Вставить("ЭквайринговыйТерминал", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ЭквайринговыйТерминал));
		ТЧОплатаПлатежнымиКартами.Добавить(НовСтр);

	КонецЦикла;

	definition.Вставить("ТЧОплатаПлатежнымиКартами", ТЧОплатаПлатежнымиКартами);

	//------------------------------------------------------     ТЧ ОплатаБанковскимиКредитами

	ТЧОплатаБанковскимиКредитами = Новый Массив;

	Для сч = 0 По обк.ОплатаБанковскимиКредитами.Количество()-1 Цикл

		стрк = обк.ОплатаБанковскимиКредитами[сч];

		НовСтр = Новый Структура;

		НовСтр.Вставить("БанкКредитор", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.БанкКредитор));
		НовСтр.Вставить("ВидОплаты", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ВидОплаты));
		НовСтр.Вставить("ДоговорКонтрагента", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ДоговорКонтрагента));
		НовСтр.Вставить("ПроцентБанковскойКомиссии", стрк.ПроцентБанковскойКомиссии);
		НовСтр.Вставить("Сумма", стрк.Сумма);
		НовСтр.Вставить("СуммаБанковскойКомиссии", стрк.СуммаБанковскойКомиссии);
		ТЧОплатаБанковскимиКредитами.Добавить(НовСтр);

	КонецЦикла;

	definition.Вставить("ТЧОплатаБанковскимиКредитами", ТЧОплатаБанковскимиКредитами);

	//------------------------------------------------------     ТЧ ПродажиПоДисконтнымКартам

	ТЧПродажиПоДисконтнымКартам = Новый Массив;

	Для сч = 0 По обк.ПродажиПоДисконтнымКартам.Количество()-1 Цикл

		стрк = обк.ПродажиПоДисконтнымКартам[сч];

		НовСтр = Новый Структура;

		НовСтр.Вставить("ВладелецДисконтнойКарты", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ВладелецДисконтнойКарты));
		НовСтр.Вставить("ДисконтнаяКарта", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ДисконтнаяКарта));
		НовСтр.Вставить("Сумма", стрк.Сумма);
		ТЧПродажиПоДисконтнымКартам.Добавить(НовСтр);

	КонецЦикла;

	definition.Вставить("ТЧПродажиПоДисконтнымКартам", ТЧПродажиПоДисконтнымКартам);

	//------------------------------------------------------     ТЧ ОплатаНаличнымиАгентскихПлатежей

	ТЧОплатаНаличнымиАгентскихПлатежей = Новый Массив;

	Для сч = 0 По обк.ОплатаНаличнымиАгентскихПлатежей.Количество()-1 Цикл

		стрк = обк.ОплатаНаличнымиАгентскихПлатежей[сч];

		НовСтр = Новый Структура;

		НовСтр.Вставить("ДоговорКонтрагента", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ДоговорКонтрагента));
		НовСтр.Вставить("Сумма", стрк.Сумма);
		ТЧОплатаНаличнымиАгентскихПлатежей.Добавить(НовСтр);

	КонецЦикла;

	definition.Вставить("ТЧОплатаНаличнымиАгентскихПлатежей", ТЧОплатаНаличнымиАгентскихПлатежей);

	//------------------------------------------------------     ТЧ ВозвращенныеТовары

	ТЧВозвращенныеТовары = Новый Массив;

	Для сч = 0 По обк.ВозвращенныеТовары.Количество()-1 Цикл

		стрк = обк.ВозвращенныеТовары[сч];

		НовСтр = Новый Структура;

		НовСтр.Вставить("АналитикаХозяйственнойОперации", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.АналитикаХозяйственнойОперации));
		НовСтр.Вставить("ДисконтнаяКарта", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ДисконтнаяКарта));
		НовСтр.Вставить("КлючСвязи", стрк.КлючСвязи);
		НовСтр.Вставить("Количество", стрк.Количество);
		НовСтр.Вставить("КоличествоУпаковок", стрк.КоличествоУпаковок);
		НовСтр.Вставить("Номенклатура", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Номенклатура));
		НовСтр.Вставить("Продавец", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Продавец));
		НовСтр.Вставить("ПроцентСкидкиНаценки", стрк.ПроцентСкидкиНаценки);
		НовСтр.Вставить("РегистрацияПродажи", стрк.РегистрацияПродажи);
		НовСтр.Вставить("Склад", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Склад));
		НовСтр.Вставить("СтавкаНДС", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.СтавкаНДС));
		НовСтр.Вставить("Сумма", стрк.Сумма);
		НовСтр.Вставить("СуммаНДС", стрк.СуммаНДС);
		НовСтр.Вставить("Упаковка", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Упаковка));
		НовСтр.Вставить("Характеристика", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Характеристика));
		НовСтр.Вставить("Цена", стрк.Цена);
		ТЧВозвращенныеТовары.Добавить(НовСтр);

	КонецЦикла;

	definition.Вставить("ТЧВозвращенныеТовары", ТЧВозвращенныеТовары);

	//------------------------------------------------------     ТЧ СерийныеНомера

	ТЧСерийныеНомера = Новый Массив;

	Для сч = 0 По обк.СерийныеНомера.Количество()-1 Цикл

		стрк = обк.СерийныеНомера[сч];

		НовСтр = Новый Структура;

		НовСтр.Вставить("КлючСвязиСерийныхНомеров", стрк.КлючСвязиСерийныхНомеров);
		НовСтр.Вставить("СерийныйНомер", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.СерийныйНомер));
		ТЧСерийныеНомера.Добавить(НовСтр);

	КонецЦикла;

	definition.Вставить("ТЧСерийныеНомера", ТЧСерийныеНомера);

	//------------------------------------------------------     ТЧ ПогашениеПодарочныхСертификатов

	ТЧПогашениеПодарочныхСертификатов = Новый Массив;

	Для сч = 0 По обк.ПогашениеПодарочныхСертификатов.Количество()-1 Цикл

		стрк = обк.ПогашениеПодарочныхСертификатов[сч];

		НовСтр = Новый Структура;

		НовСтр.Вставить("Количество", стрк.Количество);
		НовСтр.Вставить("ПодарочныйСертификат", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ПодарочныйСертификат));
		НовСтр.Вставить("СерийныйНомер", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.СерийныйНомер));
		НовСтр.Вставить("СуммаПогашенияСертификата", стрк.СуммаПогашенияСертификата);
		ТЧПогашениеПодарочныхСертификатов.Добавить(НовСтр);

	КонецЦикла;

	definition.Вставить("ТЧПогашениеПодарочныхСертификатов", ТЧПогашениеПодарочныхСертификатов);

	//------------------------------------------------------     ТЧ Серии

	ТЧСерии = Новый Массив;

	Для сч = 0 По обк.Серии.Количество()-1 Цикл

		стрк = обк.Серии[сч];

		НовСтр = Новый Структура;

		НовСтр.Вставить("Количество", стрк.Количество);
		НовСтр.Вставить("Номенклатура", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Номенклатура));
		НовСтр.Вставить("Серия", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Серия));
		НовСтр.Вставить("Характеристика", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Характеристика));
		ТЧСерии.Добавить(НовСтр);

	КонецЦикла;

	definition.Вставить("ТЧСерии", ТЧСерии);

	//------------------------------------------------------     ТЧ БонусныеБаллыКНачислению

	ТЧБонусныеБаллыКНачислению = Новый Массив;

	Для сч = 0 По обк.БонусныеБаллыКНачислению.Количество()-1 Цикл

		стрк = обк.БонусныеБаллыКНачислению[сч];

		НовСтр = Новый Структура;

		НовСтр.Вставить("БонуснаяПрограммаЛояльности", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.БонуснаяПрограммаЛояльности));
		НовСтр.Вставить("ДатаНачисления", стрк.ДатаНачисления);
		НовСтр.Вставить("ДатаПервоначальногоНачисления", стрк.ДатаПервоначальногоНачисления);
		НовСтр.Вставить("ДатаСписания", стрк.ДатаСписания);
		НовСтр.Вставить("ДисконтнаяКарта", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ДисконтнаяКарта));
		НовСтр.Вставить("КоличествоБонусныхБаллов", стрк.КоличествоБонусныхБаллов);
		ТЧБонусныеБаллыКНачислению.Добавить(НовСтр);

	КонецЦикла;

	definition.Вставить("ТЧБонусныеБаллыКНачислению", ТЧБонусныеБаллыКНачислению);

	//------------------------------------------------------     ТЧ ОплатаБонуснымиБаллами

	ТЧОплатаБонуснымиБаллами = Новый Массив;

	Для сч = 0 По обк.ОплатаБонуснымиБаллами.Количество()-1 Цикл

		стрк = обк.ОплатаБонуснымиБаллами[сч];

		НовСтр = Новый Структура;

		НовСтр.Вставить("БонуснаяПрограммаЛояльности", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.БонуснаяПрограммаЛояльности));
		НовСтр.Вставить("ВидОплаты", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ВидОплаты));
		НовСтр.Вставить("ДисконтнаяКарта", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ДисконтнаяКарта));
		НовСтр.Вставить("КоличествоБонусов", стрк.КоличествоБонусов);
		НовСтр.Вставить("КоличествоБонусовВСкидках", стрк.КоличествоБонусовВСкидках);
		НовСтр.Вставить("СуммаБонусов", стрк.СуммаБонусов);
		НовСтр.Вставить("СуммаБонусовВСкидках", стрк.СуммаБонусовВСкидках);
		ТЧОплатаБонуснымиБаллами.Добавить(НовСтр);

	КонецЦикла;

	definition.Вставить("ТЧОплатаБонуснымиБаллами", ТЧОплатаБонуснымиБаллами);

	//------------------------------------------------------     ТЧ ПрочаяВыручка

	ТЧПрочаяВыручка = Новый Массив;

	Для сч = 0 По обк.ПрочаяВыручка.Количество()-1 Цикл

		стрк = обк.ПрочаяВыручка[сч];

		НовСтр = Новый Структура;

		НовСтр.Вставить("ВидОплаты", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ВидОплаты));
		НовСтр.Вставить("Контрагент", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Контрагент));
		НовСтр.Вставить("СуммаВозврата", стрк.СуммаВозврата);
		НовСтр.Вставить("СуммаПоступления", стрк.СуммаПоступления);
		НовСтр.Вставить("ХозяйственнаяОперация", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ХозяйственнаяОперация));
		ТЧПрочаяВыручка.Добавить(НовСтр);

	КонецЦикла;

	definition.Вставить("ТЧПрочаяВыручка", ТЧПрочаяВыручка);

	//------------------------------------------------------     ТЧ РасчетыСКлиентами

	ТЧРасчетыСКлиентами = Новый Массив;

	Для сч = 0 По обк.РасчетыСКлиентами.Количество()-1 Цикл

		стрк = обк.РасчетыСКлиентами[сч];

		НовСтр = Новый Структура;

		НовСтр.Вставить("ДокументРасчета", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ДокументРасчета));
		НовСтр.Вставить("ЗаказПокупателя", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ЗаказПокупателя));
		НовСтр.Вставить("Контрагент", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Контрагент));
		НовСтр.Вставить("Оплачено", стрк.Оплачено);
		НовСтр.Вставить("Отгружено", стрк.Отгружено);
		ТЧРасчетыСКлиентами.Добавить(НовСтр);

	КонецЦикла;

	definition.Вставить("ТЧРасчетыСКлиентами", ТЧРасчетыСКлиентами);

	//------------------------------------------------------     ТЧ АкцизныеМарки

	ТЧАкцизныеМарки = Новый Массив;

	Для сч = 0 По обк.АкцизныеМарки.Количество()-1 Цикл

		стрк = обк.АкцизныеМарки[сч];

		НовСтр = Новый Структура;

		НовСтр.Вставить("АкцизнаяМарка", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.АкцизнаяМарка));
		НовСтр.Вставить("Возврат", стрк.Возврат);
		НовСтр.Вставить("Справка2", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Справка2));
		ТЧАкцизныеМарки.Добавить(НовСтр);

	КонецЦикла;

	definition.Вставить("ТЧАкцизныеМарки", ТЧАкцизныеМарки);




	//------------------------------------------------------ ФИНАЛ


	СтруктураОбъекта.Вставить("definition", definition);
	ЗаписатьJSON(ЗаписьJson, СтруктураОбъекта);
	json = ЗаписьJson.Закрыть();
	Возврат json;
КонецФункции



