
&НаСервере
Функция ВыгрузитьОбъектНаСервере()
	json = РеквизитФормыВЗначение("Объект").ВыгрузитьОбъект(СсылочныйТип);
	return json;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьОбъект(Команда)
	json = ВыгрузитьОбъектНаСервере();
	message(json);
КонецПроцедуры



&НаСервере
Процедура СоздатьТестовыйОбъектНаСервере()
	НачатьТранзакцию();
	
	ТестовыйОбъект = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	ТестовыйОбъект.дата = ТекущаяДатаСеанса();
	
	ТестовыйОбъект.Товары.Добавить();
	ТестовыйОбъект.СерийныеНомера.Добавить();
	ТестовыйОбъект.Серии.Добавить();

	ТестовыйОбъект.ОбменДанными.Загрузка = Истина;
	ТестовыйОбъект.Записать();
	
	СсылочныйТип = ТестовыйОбъект.Ссылка;
	
	сообщить(ВыгрузитьОбъектНаСервере());
	
	ОтменитьТранзакцию();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьТестовыйОбъект(Команда)
	СоздатьТестовыйОбъектНаСервере();
КонецПроцедуры

