
&НаСервере
Функция ВыгрузитьОбъектНаСервере()
	json = РеквизитФормыВЗначение("Объект").ВыгрузитьОбъект(СсылочныйТип);
	return json;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьОбъект(Команда)
	json = ВыгрузитьОбъектНаСервере();
	message(json);
КонецПроцедуры



&НаСервере
Процедура СоздатьТестовыйОбъектНаСервере()
	НачатьТранзакцию();
	
	ТестовыйОбъект = Документы.ОтчетОРозничныхПродажах.СоздатьДокумент();
	ТестовыйОбъект.дата = ТекущаяДатаСеанса();
	
	ТестовыйОбъект.Товары.Добавить();
	ТестовыйОбъект.ОплатаПлатежнымиКартами.Добавить();
	ТестовыйОбъект.ОплатаБанковскимиКредитами.Добавить();
	
	ТестовыйОбъект.ПродажиПоДисконтнымКартам.Добавить();
	ТестовыйОбъект.ОплатаНаличнымиАгентскихПлатежей.Добавить();
	ТестовыйОбъект.ВозвращенныеТовары.Добавить();
	ТестовыйОбъект.СерийныеНомера.Добавить();
	ТестовыйОбъект.ПогашениеПодарочныхСертификатов.Добавить();
	ТестовыйОбъект.Серии.Добавить();
	ТестовыйОбъект.БонусныеБаллыКНачислению.Добавить();
	ТестовыйОбъект.ОплатаБонуснымиБаллами.Добавить();
	ТестовыйОбъект.ПрочаяВыручка.Добавить();
	ТестовыйОбъект.РасчетыСКлиентами.Добавить();
	ТестовыйОбъект.АкцизныеМарки.Добавить();
	

	ТестовыйОбъект.ОбменДанными.Загрузка = Истина;
	ТестовыйОбъект.Записать();
	
	СсылочныйТип = ТестовыйОбъект.Ссылка;
	
	сообщить(ВыгрузитьОбъектНаСервере());
	
	ОтменитьТранзакцию();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьТестовыйОбъект(Команда)
	СоздатьТестовыйОбъектНаСервере();
КонецПроцедуры

