
&НаКлиенте
Процедура ЗапуститьТест(Команда)
	
	
	Сообщить(ИмяФайла()); 
	 
	ЗапуститьТестНаСервере( ИмяФайла() ); 
	
КонецПроцедуры


&НаСервере
Процедура ЗапуститьТестНаСервере(ИмяФайлаЭтойОбработки)
	// найти плагины в текущем каталоге
	
	_м = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяФайлаЭтойОбработки, "\");
	
	Путь = "";
	Для сч=0 По _м.Количество()-2 Цикл
		Путь = Путь + _м[сч]+"\";
	КонецЦикла;
	
	мФайлы = НайтиФайлы(Путь, "*.epf", false);
	
	
КонецПроцедуры


&НаСервере
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ИмяФайла()
		
	Возврат РеквизитФормыВЗначение("Объект").ИспользуемоеИмяФайла ;
	
КонецФункции
