
&НаСервере
Процедура testНаСервере()
	обк = РеквизитФормыВЗначение("Объект");
	обк.ВыполнитьЭкспорт();
КонецПроцедуры

&НаКлиенте
Процедура test(Команда)
	testНаСервере();
КонецПроцедуры

&НаСервере
Функция СформироватьJsonСправочникНоменклатураНаСервере()
	json = РеквизитФормыВЗначение("Объект")
		.СформироватьJsonСправочникНоменклатура(Номенклатура);
	return json;
КонецФункции

&НаКлиенте
Процедура СформироватьJsonСправочникНоменклатура(Команда)
	json = СформироватьJsonСправочникНоменклатураНаСервере();
	message(json);
КонецПроцедуры



&НаСервере
Процедура ВыполнитьЭкспортНаСервере()
	РеквизитФормыВЗначение("Объект").ВыполнитьЭкспорт();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЭкспорт(Команда)
	ВыполнитьЭкспортНаСервере();
	ПоказатьПредупреждение(,"Экспорт выполнен!");
КонецПроцедуры




#Область ТестыНакладныхРасходовРэббита

// коннект создается 1 раз

&НаСервере
Процедура ТестНакладныхРасходов1НаСервере()
	РеквизитФормыВЗначение("Объект").ТестНакладныхРасходов1НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТестНакладныхРасходов1(Команда)
	ТестНакладныхРасходов1НаСервере();
	ПоказатьПредупреждение(,"Тестирование 1 завершено!");
КонецПроцедуры


// коннект создается на каждый вызов BasicPublish

&НаСервере
Процедура ТестНакладныхРасходов2НаСервере()
	РеквизитФормыВЗначение("Объект").ТестНакладныхРасходов2НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТестНакладныхРасходов2(Команда)
	ТестНакладныхРасходов2НаСервере();
	ПоказатьПредупреждение(,"Тестирование 2 завершено!");
КонецПроцедуры


#КонецОбласти    


